Repository: Code4PuertoRico/django-replication
Catalog: apps/replicate/locale/*/LC_MESSAGES/django.po
Languages: es

source: copy
es: copia

source: 1 conduit set was
es: 1 juego de conductos fue

source: %s conduit sets were
es: %s juegos de conductos fueron

source: %s manually executed. Check log file for results.
es: %s manualmente executados. Verifique la bitacora para resultados.

source: Manually execute conduit set
es: Ejecutar manualmente juego de conductos

source: 1 schedule was
es: 1 programa fue

source: %s schedules were
es: %s programas fueron

source: Manually execute schedule
es: Executar horario manualmente

source: 1 conduit was
es: 1 conducto fue

source: %s conduits were
es: %s conductos fueron

source: %s enabled.
es: %s activado.

source: Enable schedule
es: Activar horario

source: %s disabled.
es: %s desactivado.

source: Disable schedule
es: Desactivar horario

source: Error handling
es: Manejo de errores

source: Performance
es: Desempe¤o

source: Timeouts
es: Limite de tiempos

source: Manually execute conduit
es: Ejecutar manualmente conducto

source: %s copied.
es: %s copiado(s).

source: Copy the selected object
es: Copiar el objeto seleccionado

source: name
es: nombre

source: A name to identify this host.
es: Un nombre para identificar esta maquina.

source: IP address
es: Direccion IP

source: host
es: maquina

source: hosts
es: maquinas

source: backend
es: manejador

source: Database driver to be used
es: Manejador de bases de datos a ser usado

source: Name of the database (or ORACLE database service name)
es: Nombre de la base de datos (o nombre del servicio de ORACLE)

source: options
es: opciones

source: username
es: usuario

source: The username that will be used to connect to this database
es: El usuario que se utilizara para conectarse a la base de datos

source: password
es: contraseña

source: Password of the user that will be used to connect to the database
es: La contraseña del usuario que se utilizara para conectarse a la base de datos

source: port
es: puerto

source: The port used to connect to the database, leave blank for default port number
es: El puerto utilizado para conectarse a la base de datos, deje en blanco para el número de puerto por defecto

source: timezone
es: zona horaria

source: database
es: base de datos

source: databases
es: bases de datos

source: Incremental/slave append only (no updates or deletes on slave)
es: Incremental / esclavo anexar solamente (sin cambios o eliminaciones en esclavo)

source: Empty/append alias Full, Snapshot *N/A*
es: Vaciar / agregar todos / copia completa * N / D *

source: type
es: tipo

source: Database where records will be fetch.
es: Base de datos de donde se extraeran los records.

source: master database
es: base de datos maestra

source: Database that will receive (or update, or delete) records.
es: Base de datos que va a recibir (o actualizar o eliminar) los registros.

source: slave database
es: base de datos esclava

source: master table
es: tabla maestra

source: Limits the amount of master keys compared for replication. Also useful in fan-out style replication.
es: Limita la cantidad de llaves maestras comparadas para la replicación. También es útil en el estilos de replicación: de uno a muchos.

source: master subset
es: subconjunto maestro

source: slave table
es: tabla esclava

source: Limits the amount of slave keys compared for replication. Also useful in fan-in style replication.
es: Limita la cantidad de llaves esclavas comparas para la replicación. También es útil en estilo de replicación: de muchos a uno.

source: slave subset
es: subconjunto esclavo

source: Master
es: Maestra

source: Slave
es: Esclava

source: primary key source
es: fuente de la llave primaria

source: Determines which database (master or slave) is going to be queried to determine the primary key.
es: Determina cual de las bases de datos (maestro o esclavo) va a ser consultada para determinar la llave principal.

source: Only works for MySQL databases so far.
es: Sólo funciona con bases de datos MySQL por el momento.

source: detect primary key
es: detectar llave primaria

source: Comma separated list of fields that compose a primary key.
es: Lista de campos separados por coma, que componen la llave primaria.

source: key fields
es: cambos que componen la llave

source: Size of keys block to fetch from master when comparing master/slave difference (optimization value affected by: network speed/latency, computer memory ammount).
es: Tamaño de bloque de llaves maestras a buscar a la hora de comparar con la diferencia maestro / esclavo (valor de la optimización es afectado por: la velocidad de red o la latencia, la cantidad de memoria del ordenador).

source: master key fetch buffer size
es: tamaño de bloque de llaves a buscar

source: Amount of records to append per conduit execution (this value is independant of [master_key_batchsize] value.
es: Cantidad de filas a agregar por ejecución de conducto (este valor es independiente del valor de [tamaño de bloque de llaves a buscar].

source: conduit batchsize
es: tamaño de lote del conducto

source: Comma separated list of fields that will be replicated, if not specified all fields will be used.
es: Lista separada por comas de los campos que se extraeran para la replicación, si no se especifica todos los campos se utilizarán.

source: field to fetch
es: campo a extraer

source: Don't actually modify any data only log messages
es: No modificar ningun dato solo se actualiza la bitacora

source: dry run
es: corrida de prueba

source: Ignore situations where a single slave append query returns an error (typical of incorrect primary key fields)
es: Ignorar situaciones en que un solo una cosulta de anexar del esclavo devuelve un error (típico de una lista incorrecta de campos de llave principal)

source: ignore slave modify error
es: ignorar error de modificacion de esclavo

source: slave warnings abort threshold
es: umbral de aborto de advertencias de esclavos

source: master warnings abort threshold
es: umbral de aborto de advertencias de maestro

source: The maximum ammount of time that this conduit is allowed to execute before it gets stopped.
es: La cantidad máxima de tiempo que este conducto se permitirá ejecutar antes que sea detenido.

source: conduit timeout
es: tiempo limite del conducto

source: Timeout (in seconds) for simple database operations, such as: Establishing connections, discovering primary keys, etc.
es: Tiempo de espera (en segundos) para las operaciones de base de datos simples, tales como: Establecer conexiones, descubrir las llaves principales, etc

source: minor operations timeout
es: tiempo limite para operaciones menores

source: Timeout (in seconds) for complex database operations, such as: Fetching primary keys, fetching rows, etc.
es: Tiempo de espera (en segundos) para las operaciones de bases de datos complejas, tales como: Extracción de las llaves principales, ir a buscar records, etc

source: major operations timeout
es: tiempo limite para operaciones mayores

source: enabled
es: activado

source: conduit sets
es: sets de conductos

source: schedules
es: horarios

source: conduit
es: conducto

source: conduits
es: conductos

source: timestamp
es: estampa de tiempo

source: module
es: modulo

source: severity
es: severidad

source: message
es: mensaje

source: log
es: bitacora

source: logs
es: bitacoras

source: set name
es: nombre del set

source: concurrent
es: concurrente

source: conduit set
es: set de conductos

source: Select which conduit set to schedule.
es: Seleccione el juego de conductos a programar.

source: minute
es: minuto

source: hours
es: horas

source: day of the month
es: día del mes

source: month
es: mes

source: day of the week
es: día de la semana

source: last ran
es: ultima corrida

source: executing?
es: ¿Ejecutando?

source: January
es: Enero

source: Febraury
es: Febrero

source: March
es: Marzo

source: April
es: Abril

source: May
es: Mayo

source: June
es: Junio

source: July
es: Julio

source: August
es: Agosto

source: September
es: Septiembre

source: October
es: Octubre

source: November
es: Noviembre

source: December
es: Diciembre

source: All
es: Todos

source: schedule
es: programa
